src/openpersonen/api/response_templates/ResponseKinderenVanAanvrager.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:npsLa01-prs-KinderenVanAanvrager>
         <ns:stuurgegevens>
            <StUF:berichtcode>La01</StUF:berichtcode>
            <StUF:zender>
               <!--Optional:-->
               <StUF:organisatie>{{ zender_organisatie }}</StUF:organisatie>
               <StUF:applicatie>{{ zender_applicatie }}</StUF:applicatie>
               <!--Optional:-->
               <StUF:administratie>{{ zender_administratie }}</StUF:administratie>
               <!--Optional:-->
               <StUF:gebruiker>{{ zender_gebruiker }}</StUF:gebruiker>
            </StUF:zender>
            <StUF:ontvanger>
               <!--Optional:-->
               <StUF:organisatie>{{ ontvanger_organisatie }}</StUF:organisatie>
               <StUF:applicatie>{{ ontvanger_applicatie }}</StUF:applicatie>
               <!--Optional:-->
               <StUF:administratie>{{ ontvanger_administratie }}</StUF:administratie>
               <!--Optional:-->
               <StUF:gebruiker>{{ ontvanger_gebruiker }}</StUF:gebruiker>
            </StUF:ontvanger>
            <!--Optional:-->
            <StUF:referentienummer>{{ referentienummer }}</StUF:referentienummer>
            <StUF:tijdstipBericht>{{ tijdstip_bericht }}</StUF:tijdstipBericht>
            <!--Optional:-->
            <StUF:crossRefnummer>?</StUF:crossRefnummer>
            <StUF:entiteittype>NPS</StUF:entiteittype>
         </ns:stuurgegevens>
         <ns:parameters>
            <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
         </ns:parameters>
         <!--Zero or more repetitions:-->
         <ns:melding>?</ns:melding>
         <ns:antwoord>
            <ns:object StUF:entiteittype="NPS" StUF:sleutelVerzendend="?" StUF:sleutelSynchronisatie="?" StUF:noValue="?">
               <ns:inp.bsn StUF:noValue="?" StUF:exact="true">?</ns:inp.bsn>
               <ns:geslachtsnaam StUF:noValue="?" StUF:exact="true">?</ns:geslachtsnaam>
               <ns:voorvoegselGeslachtsnaam StUF:noValue="?" StUF:exact="true">?</ns:voorvoegselGeslachtsnaam>
               <ns:voorletters StUF:noValue="?" StUF:exact="true">?</ns:voorletters>
               <ns:voornamen StUF:noValue="?" StUF:exact="true">?</ns:voornamen>
               <ns:aanduidingNaamgebruik StUF:noValue="?" StUF:exact="true">?</ns:aanduidingNaamgebruik>
               <ns:geslachtsnaamPartner StUF:noValue="?" StUF:exact="true">?</ns:geslachtsnaamPartner>
               <ns:voorvoegselGeslachtsnaamPartner StUF:noValue="?" StUF:exact="true">?</ns:voorvoegselGeslachtsnaamPartner>
               <!--Optional:-->
               <ns:aanhefAanschrijving StUF:noValue="?" StUF:exact="true">?</ns:aanhefAanschrijving>
               <!--Optional:-->
               <ns:voornamenAanschrijving StUF:noValue="?" StUF:exact="true">?</ns:voornamenAanschrijving>
               <!--Optional:-->
               <ns:geslachtsnaamAanschrijving StUF:noValue="?" StUF:exact="true">?</ns:geslachtsnaamAanschrijving>
               <!--Optional:-->
               <ns:adellijkeTitelPredikaat StUF:noValue="?" StUF:exact="true">?</ns:adellijkeTitelPredikaat>
               <ns:geslachtsaanduiding StUF:noValue="?" StUF:exact="true">?</ns:geslachtsaanduiding>
               <ns:geboortedatum StUF:noValue="?" StUF:exact="true" StUF:indOnvolledigeDatum="V">?</ns:geboortedatum>
               <ns:inp.geboorteplaats StUF:noValue="?" StUF:exact="true">?</ns:inp.geboorteplaats>
               <ns:inp.geboorteLand StUF:noValue="?" StUF:exact="true">?</ns:inp.geboorteLand>
               <!--Optional:-->
               <ns:overlijdensdatum StUF:noValue="?" StUF:exact="true" StUF:indOnvolledigeDatum="V">?</ns:overlijdensdatum>
               <!--You have a CHOICE of the next 2 items at this level-->
               <ns:verblijfsadres>
                  <ns:aoa.identificatie StUF:noValue="?" StUF:exact="true">?</ns:aoa.identificatie>
                  <ns:wpl.identificatie StUF:noValue="?" StUF:exact="true">?</ns:wpl.identificatie>
                  <ns:wpl.woonplaatsNaam StUF:noValue="?" StUF:exact="true">?</ns:wpl.woonplaatsNaam>
                  <ns:gor.openbareRuimteNaam StUF:noValue="?" StUF:exact="true">?</ns:gor.openbareRuimteNaam>
                  <ns:gor.straatnaam StUF:noValue="?" StUF:exact="true">?</ns:gor.straatnaam>
                  <ns:aoa.postcode StUF:noValue="?" StUF:exact="true">?</ns:aoa.postcode>
                  <ns:aoa.huisnummer StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisnummer>
                  <ns:aoa.huisletter StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisletter>
                  <ns:aoa.huisnummertoevoeging StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisnummertoevoeging>
                  <ns:inp.locatiebeschrijving StUF:noValue="?" StUF:exact="true">?</ns:inp.locatiebeschrijving>
               </ns:verblijfsadres>
               <!--Optional:-->
               <ns:sub.verblijfBuitenland>
                  <!--Optional:-->
                  <ns:lnd.landcode StUF:noValue="?" StUF:exact="true">?</ns:lnd.landcode>
                  <!--Optional:-->
                  <ns:lnd.landnaam StUF:noValue="?" StUF:exact="true">?</ns:lnd.landnaam>
                  <!--Optional:-->
                  <ns:sub.adresBuitenland1 StUF:noValue="?" StUF:exact="true">?</ns:sub.adresBuitenland1>
                  <!--Optional:-->
                  <ns:sub.adresBuitenland2 StUF:noValue="?" StUF:exact="true">?</ns:sub.adresBuitenland2>
                  <!--Optional:-->
                  <ns:sub.adresBuitenland3 StUF:noValue="?" StUF:exact="true">?</ns:sub.adresBuitenland3>
               </ns:sub.verblijfBuitenland>
               <!--Optional:-->
               <ns:sub.correspondentieAdres>
                  <ns:wpl.woonplaatsNaam StUF:noValue="?" StUF:exact="true">?</ns:wpl.woonplaatsNaam>
                  <ns:postcode StUF:noValue="?" StUF:exact="true">?</ns:postcode>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <ns:aoa.identificatie StUF:noValue="?" StUF:exact="true">?</ns:aoa.identificatie>
                  <ns:gor.openbareRuimteNaam StUF:noValue="?" StUF:exact="true">?</ns:gor.openbareRuimteNaam>
                  <ns:aoa.huisnummer StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisnummer>
                  <ns:aoa.huisletter StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisletter>
                  <ns:aoa.huisnummertoevoeging StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisnummertoevoeging>
                  <ns:sub.postadresType StUF:noValue="?" StUF:exact="true">?</ns:sub.postadresType>
                  <ns:sub.postadresNummer StUF:noValue="?" StUF:exact="true">?</ns:sub.postadresNummer>
               </ns:sub.correspondentieAdres>
               <!--Optional:-->
               <ns:sub.telefoonnummer StUF:noValue="?" StUF:exact="true">?</ns:sub.telefoonnummer>
               <!--Optional:-->
               <ns:sub.faxnummer StUF:noValue="?" StUF:exact="true">?</ns:sub.faxnummer>
               <!--Optional:-->
               <ns:sub.emailadres StUF:noValue="?" StUF:exact="true">?</ns:sub.emailadres>
               <!--0 to 3 repetitions:-->
               <ns:acd.code StUF:noValue="?" StUF:exact="true">?</ns:acd.code>
               <!--Optional:-->
               <StUF:extraElementen>
                  <!--1 or more repetitions:-->
                  <StUF:extraElement StUF:noValue="?" StUF:exact="true" naam="?" StUF:indOnvolledigeDatum="V">?</StUF:extraElement>
               </StUF:extraElementen>
               <!--Zero or more repetitions:-->
               <ns:inp.heeftAlsKinderen StUF:entiteittype="NPSNPSKND" StUF:sleutelVerzendend="?" StUF:sleutelSynchronisatie="?" StUF:noValue="?">
                  <ns:gerelateerde StUF:entiteittype="NPS" StUF:sleutelVerzendend="?" StUF:sleutelSynchronisatie="?" StUF:noValue="?">
                     <ns:inp.bsn StUF:noValue="?" StUF:exact="true">?</ns:inp.bsn>
                     <ns:geslachtsnaam StUF:noValue="?" StUF:exact="true">?</ns:geslachtsnaam>
                     <ns:voorvoegselGeslachtsnaam StUF:noValue="?" StUF:exact="true">?</ns:voorvoegselGeslachtsnaam>
                     <ns:voorletters StUF:noValue="?" StUF:exact="true">?</ns:voorletters>
                     <ns:voornamen StUF:noValue="?" StUF:exact="true">?</ns:voornamen>
                     <ns:geslachtsaanduiding StUF:noValue="?" StUF:exact="true">?</ns:geslachtsaanduiding>
                     <ns:geboortedatum StUF:noValue="?" StUF:exact="true" StUF:indOnvolledigeDatum="V">?</ns:geboortedatum>
                     <ns:verblijfsadres>
                        <ns:aoa.identificatie StUF:noValue="?" StUF:exact="true">?</ns:aoa.identificatie>
                        <ns:wpl.identificatie StUF:noValue="?" StUF:exact="true">?</ns:wpl.identificatie>
                        <ns:wpl.woonplaatsNaam StUF:noValue="?" StUF:exact="true">?</ns:wpl.woonplaatsNaam>
                        <ns:gor.openbareRuimteNaam StUF:noValue="?" StUF:exact="true">?</ns:gor.openbareRuimteNaam>
                        <ns:gor.straatnaam StUF:noValue="?" StUF:exact="true">?</ns:gor.straatnaam>
                        <ns:aoa.postcode StUF:noValue="?" StUF:exact="true">?</ns:aoa.postcode>
                        <ns:aoa.huisnummer StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisnummer>
                        <ns:aoa.huisletter StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisletter>
                        <ns:aoa.huisnummertoevoeging StUF:noValue="?" StUF:exact="true">?</ns:aoa.huisnummertoevoeging>
                        <ns:inp.locatiebeschrijving StUF:noValue="?" StUF:exact="true">?</ns:inp.locatiebeschrijving>
                     </ns:verblijfsadres>
                  </ns:gerelateerde>
               </ns:inp.heeftAlsKinderen>
               <!--Zero or more repetitions:-->
               <ns:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT" StUF:sleutelVerzendend="?" StUF:sleutelOntvangend="?" StUF:sleutelGegevensbeheer="?" StUF:sleutelSynchronisatie="?" StUF:noValue="?">
                  <ns:gerelateerde StUF:entiteittype="NAT">
                     <!--Optional:-->
                     <ns:code StUF:noValue="?" StUF:exact="true">?</ns:code>
                     <!--Optional:-->
                     <ns:omschrijving StUF:noValue="?" StUF:exact="true">?</ns:omschrijving>
                  </ns:gerelateerde>
               </ns:inp.heeftAlsNationaliteit>
            </ns:object>
         </ns:antwoord>
      </ns:npsLa01-prs-KinderenVanAanvrager>
   </soapenv:Body>
</soapenv:Envelope>
